## Plan Result (demo-apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw"
        name                              = "sdshmcts-apim00-demo-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (7 unchanged attributes hidden)

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/backendAddressPools/sds-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "sds-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/backendHttpSettingsCollection/sds-api-mgmt-appgw" -> null
          - backend_http_settings_name = "sds-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/httpListeners/sds-api-mgmt-appgw" -> null
          - http_listener_name         = "sds-api-mgmt-appgw" -> null
          - id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/requestRoutingRules/sds-api-mgmt-appgw" -> null
          - name                       = "sds-api-mgmt-appgw" -> null
          - priority                   = 10 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/backendAddressPools/sds-mtls-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "sds-mtls-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/backendHttpSettingsCollection/sds-mtls-api-mgmt-appgw" -> null
          - backend_http_settings_name = "sds-mtls-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/httpListeners/sds-mtls-api-mgmt-appgw" -> null
          - http_listener_name         = "sds-mtls-api-mgmt-appgw" -> null
          - id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/requestRoutingRules/sds-mtls-api-mgmt-appgw" -> null
          - name                       = "sds-mtls-api-mgmt-appgw" -> null
          - priority                   = 20 -> null
          - rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/rewriteRuleSets/1" -> null
          - rewrite_rule_set_name      = "1" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/backendAddressPools/sds-api-mgmt-appgw"
          + backend_address_pool_name  = "sds-api-mgmt-appgw"
          + backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/backendHttpSettingsCollection/sds-api-mgmt-appgw"
          + backend_http_settings_name = "sds-api-mgmt-appgw"
          + http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/httpListeners/sds-api-mgmt-appgw"
          + http_listener_name         = "sds-api-mgmt-appgw"
          + id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/requestRoutingRules/sds-api-mgmt-appgw"
          + name                       = "sds-api-mgmt-appgw"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sds-mtls-api-mgmt-appgw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sds-mtls-api-mgmt-appgw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sds-mtls-api-mgmt-appgw"
          + id                         = (known after apply)
          + name                       = "sds-mtls-api-mgmt-appgw"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      - rewrite_rule_set {
          - id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw/rewriteRuleSets/1" -> null
          - name = "1" -> null

          - rewrite_rule {
              - name          = "NewRewrite" -> null
              - rule_sequence = 100 -> null

              - request_header_configuration {
                  - header_name  = "X-ARR-ClientCert-AGW" -> null
                  - header_value = "{var_client_certificate}" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-ARR-ClientCert-EndDate-AGW" -> null
                  - header_value = "{var_client_certificate_end_date}" -> null
                }
            }
        }

        # (21 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":444,"Program":"tfcmt","SHA1":"","Target":"demo-apim_appgw","Vars":{}} -->